app/controllers/fares_controller.rb

SELECT `fares`.* FROM `fares`
---
  def index
    @fares = Fare.all

INSERT INTO `fares` (`ent`, `ext`, `price`, `created_at`, `updated_at`) VALUES ('a', 'b', 100, '2019-01-04 03:09:41', '2019-01-04 03:09:41')
---
  def create
    @fare = Fare.new(fare_params)

    respond_to do |format|
      if @fare.save

DELETE FROM `fares` WHERE `fares`.`id` = 1
---
  def destroy
    @fare.destroy

SELECT  `fares`.* FROM `fares` WHERE `fares`.`id` = 1 LIMIT 1
---
    def set_fare
      @fare = Fare.find(params[:id])