app/controllers/fx_controller.rb

  def calc

    @fare = Fare.where(ent: params[:ent]).where(ext: params[:ext]).first
---
SELECT  `fares`.* FROM `fares` WHERE `fares`.`ent` = 'tokyo' AND `fares`.`ext` = 'fukuoka' ORDER BY `fares`.`id` ASC LIMIT 1