app/controllers/fx_controller.rb

SELECT `fares`.* FROM `fares`
---
  def index
    @fares = Fare.all

SELECT  `fares`.* FROM `fares` WHERE `fares`.`ent` = 'tokyo' AND `fares`.`ext` = 'fukuoka' ORDER BY `fares`.`id` ASC LIMIT 1
---
  def show
    @fare = Fare.where(ent: params[:ent]).where(ext: params[:ext]).first