app/controllers/reserves_controller.rb

SELECT `reserves`.* FROM `reserves`
---
  def index
    @reserves = Reserve.all

SELECT  `reserves`.* FROM `reserves` WHERE `reserves`.`id` = 1 LIMIT 1
---
    def set_reserf
      @reserf = Reserve.find(params[:id])