app/controllers/rx_controller.rb

  def regist

    @reserve = Reserve.create(name: params[:name], date: params[:date], \
                              ent: params[:ent], ext: params[:ext], amount: params[:amount])
---
INSERT INTO `reserves` (`name`, `date`, `ent`, `ext`, `amount`, `created_at`, `updated_at`) VALUES ('a', '2020-04-01', 'tokyo', 'furukuoka', 10000, '2019-01-07 11:02:08', '2019-01-07 11:02:08')